IDEA Open Model
IAppController.GetConnectionData Method
[Missing <summary> documentation for "M:IdeaRS.OpenModel.Connection.IAppController.GetConnectionData(System.Guid)"]
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
string GetConnectionData(
	Guid connectionId
)
Function GetConnectionData (
	connectionId As Guid
) As String
String^ GetConnectionData(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.OpenModel.Connection.IAppController.GetConnectionData(System.Guid)"]
Return Value
Type: String
[Missing <returns> documentation for "M:IdeaRS.OpenModel.Connection.IAppController.GetConnectionData(System.Guid)"]
See Also
Reference
IAppController Interface
IdeaRS.OpenModel.Connection Namespace